const String HEADER =
    "ГУО «Ясли-сад  № 64 г. Бреста»\nПсихолого-педагогическая характеристика\n\nОбщие сведения";
const String GENERALINFORMATION = "Общие сведения ";
const String INITIALSFIRSTTEACHER = "Инициалы и фамилия первого воспитателя: ";
const String INITIALSSECONDTEACHER = "Инициалы и фамилия второго воспитателя: ";
const String FIOCHILD = "ФИО ребенка: ";
const String DATEOFBIRTH = "Дата рождения: ";
const String CHOOSE_DATE = "Выберите дату";
const String BIRTHDATE_FORMAT = "dd.MM.yyyy";
const String GROUP = "Группа: ";
const String HOMEADDRES = "Домашний адрес: ";
const String PHONENUMBER = "Контактный телефон: ";
const String FAMILY = "Семья: ";
const String CONDITIONS = "Условия воспитания: ";
const String INFROMATION_ABOUT_PARENTS = "Сведения о родителях ";
const String MOTHERS_NAME = "ФИО матери: ";
const String MOTHERS_OCCUPATION = "Занятость матери: ";
const String MOTHERS_EDUCATION = "Образование матери: ";
const String MOTHERS_WORK = "Место работы матери: ";
const String MOBILENUMBER = "Мобильный телефон: ";
const String FATHERS_NAME = "ФИО отца: ";
const String FATHERS_EDUCATION = "Образование отца: ";
const String FATHERS_OCCUPATION = "Занятость отца: ";
const String FATHERS_WORK = "Место работы отца: ";
const String YEAROFBIRTH = "Год рождения: ";
const String EDUCATION = "Образование: ";
const String COMPLAIN_PARENTS = "Жалобы родителей (причина обращения за помощью): ";
const String HELP_PROVIDED = "Какая помощь была оказана ребенку ранее: ";
const String PECULIARITIES_GAMING = "Особенности развития игровой деятельности ";
const String CHARACTER_OF_ACTIVITY_TOYS = "Характер действий с предметами-игрушками: ";
const String INTEREST_IN_TOYS = "Проявление интереса к игрушкам, стойкость интереса: ";
const String FAIRNESS_TOYS = "Адекватность употребления игрушек: ";
const String USE_STUFF = "Использование предметов-заместителей: ";
const String ADAPTIVE_ACTIVITY = "Адаптивное поведение ";
const String SELFCATERING = "Самообслуживание: ";
const String COMMUNICATION_SKILLS = "Навыки общения: ";
const String CHOOSEN_ACTIVITY = "Предпочитаемые занятия: ";

const String LEVEL_OF_SPEC_PREPARATION = "Уровень специальной подготовки: ";
const String GENERAL_AWARENESS = "Общая осведомленность: ";
const String ELEMENTS_OF_MATH = "Элементы математических представлений: ";
const String LETTERS_KNOWLEDGE = "Знание букв, чтение: ";
const String ARTS = "Изобразительная деятельность, навыки рисования, аппликации, лепки и конструирования; ";
const String RESULT_COUNCALER_TEACHER = "Результаты психолого-педагогического обследования; ";
const String INITIALS_PSYCHO = "Инициалы и фамилия психолога: ";
const String EMOTIONAL_SPHER = "Эмоционально-волевая сфера ";
const String CONTACT = "Контактность: ";
const String EMOTIONS = "Эмоции: ";
const String EMOTIONALFON = "Эмоциональный фон: ";
const String REACTIONFORPOOCHRENIEIPORICANIE = "Реакция на поощрение и порицание: ";
const String REACTIONPOSSHRENIE = "поощрение: ";
const String REACTIONPORICATIEN = "порицание: ";
const String SELFESTIMATE = "Самооценка и уровень притязаний: ";
const String CARACTER_SPECIAL = "Характерологические особенности: ";
const String CONDITION_ACTIVITY = "Состояние двигательной сферы ";
const String STATIV_DYNAMIC_COORDINATION = "Статическая и динамическая координации: ";
const String GENERAL_MOTORICA = "Общая моторика: ";
const String LITTLE_MOTORICA = "Мелкая моторика: ";
const String MIMICAL_MOTORICA = "Мимическая моторика: ";
const String PRIORITY_HAND = "Ведущая рука: ";
const String DEVELOP_QUARIS_ACTIVITY = "Особенности развития познавательной деятельности ";
const String ATTENTION = "Внимание ";
const String PROIZVOL = "Произвольность: ";
const String SUSTAINABILITY = "Устойчивость: ";
const String VOLUME = "Объем: ";
const String PERCEPTION = "Восприятие: ";
const String TACTICAL_PERCEPTION = "Тактильное восприятие: ";
const String SPACE_PERSEPTION = "Пространственные представления: ";
const String TIME_PERSEPTION = "Временные представления: ";
const String CONSTRUCTIVE_PRACSIS = "Конструктивный праксис: ";
const String MEMORY = "Память: ";

const String IMAGINATION = "Воображение(последовательные картинки): ";
const String THINKING = "Мышление ";
const String ACCEPT_TASK = "Принятие задачи: ";
const String MODES_OF_ACTION = "Способы действия: ";
const String FORM_OF_THINK = "Преобладающая форма мышления: ";
const String OPER_OF_THINK = "Операционная сторона мышления ";
const String ANALYS_SYNTES = "анализ и синтез: ";
const String GENERALIZATION = "обобщение: ";
const String PERENOS = "перенос: ";
const String SRAVNENIE = "сравнение: ";
const String UPOR = "упорядочивание: ";
const String RESULT_WORK = "Результативность выполнения задания и возможность коррекции ошибок: ";
const String USE_KINDS_OF_HELP = "Использование различных видов помощи: ";
const String OCCUPATION_ACTIVITY = "Характер деятельности: ";
const String MOTIVATION = "мотивация: ";
const String TEMP_ACTIVITY = "Темп деятельности и работоспособности ";
const String TEMP = "темп: ";
const String RABOTOSPOSOBNOST = "работоспособность: ";
const String TEACHER_DEFECT = "Учитель дефектолог: ";
const String OSOBENNOTI_RECHEVOGO = "Особенности речевого развития";
const String DORECHEVO = "Доречевой и речевой анамнез: ";
const String IMPRESSION_SPEECH = "Импрессивная речь: ";
const String EKSPRESSION_SPEECH = "Экспрессивная речь: ";
const String DICTIONARY = "Словарь: ";
const String SLOG_STRUCTURE = "Слоговая структура: ";
const String GRAMMAR_STRUCTURE = "Грамматический строй: ";
const String GRAMMAR_SPEECH = "Связная речь: ";
const String SOUNDS = "Звукопроизношение: ";
const String ARTIKUL_APPARAT = "Артикуляционный аппарат: ";
const String ARTIKUL_MOTORICA = "Артикуляционная моторика: ";
const String BREATHE_VIOCE = "Дыхательно-голосовые функции и просадика: ";
const String ZAIKANIE = "Заикание: ";
const String FONEMATIC_HEAR = "Фонематический слух: ";
const String FONEMATIC_ANALIS_SYNTES = "Фонематический анализ и синтез: ";





































const List<String> GROUP_ITEMS = ["1 млад. \"А\"", "1 млад. \"Б\"", "1 млад. \"В\"", "2 млад. \"А\"", "2 млад. \"Б\"", "2 млад. \"В\"", "средняя спец. \"А\"", "средняя спец. \"Б\"","старшая спец. \"А\"", "старшая спец. \"Б\"", "средняя интегрированная", "старшая интегрированная"];
const List<String> FAMILY_ITEMS = ["биологическая полная", "биологическая неполная", "одинокая мать", "многодетная", "малообеспеченная", "опека", "госопека"];
const List<String> CONDITIONS_ITEMS = ["хорошие", "удовлетворительные"];
const List<String> EDUCATIONS_ITEMS = ["базовое", "общее среднее", "профессионально-техническое", "среднее специальное", "высшее"];
const List<String> MOTHERS_OCCUPATION_ITEMS = ["работает","в д/о по уходу за ребенком","ухаживает за ребенком инвалидом","временно безработная", "домохозяйка", "недееспособная", "осуждена"];
const List<String> FATHERS_OCCUPATION_ITEMS = ["работает", "временно безработный", "недееспособный", "осужден"];
const List<String> HELP_PROVIDED_ITEMS = ["консультация психолога", "консультация логопеда", "консультация педагога-психолога и учителя-дефектолога"];
const List<String> CHARACTER_OF_ACTIVITY_TOYS_ITEMS = ["манипуляции", "предментные действия", "процессуальные действия", "игра с элементами сюжета", "сюжетно-ролевая игра"];
const List<String> INTEREST_IN_TOYS_ITEMS = ["нестойкий интерес", "играет с игрушками, принесенными из дома","играет с игрушками, интерес стойкий", "играет с машинками", "играет с куклами", "любит играть с набором врача", "любит играть с парикмахерским набором", "любит играть с игрушечной едой"];
const List<String> FAIRNESS_TOYS_ITEMS  = ["в норме","использует по назначению"];
const List<String> USE_STUFF_ITEMS = ["использует", "не использует", "использует частично"];
const List<String> SELFCATERING_ITEMS = ["одевается с помощью взрослого, стремления к самостоятельности недостаточно выражено", "одевается самостоятельно, но требуется помощью и контроль взрослого", "ярко выражено стремление к самостоятельности в самообслуживании, желание самоутверждаться", "выполняет самообслуживание самостоятельн, с хорошим качеством, при небольшой помощи взрослого или сверстника", "по предложению воспитателя охотно оказывает помощь сверстникам(завязать шарф сзади, помочь стянуть куртку с плеч)", "активно отстаивает самостоятельность, устойчивое стремление к оказанию помощи сверстнику", "самостоятельно расстегивает и застегивает пуговицы, молнии", "завязывает шнурки", "столовые приборы не использует, ждет пока покормят", "правильно пользуется ложкой, верно держит ее", "пользуется столовыми приборами", "в процессе еды правильн держит вилку только при напоминании воспитателя", "использует салфетки", "при приеме пищи аккуратен(на)", "при приеме пищи неаккуратен(на)", "при приеме пищи все мимо тарелки", "сформированы в соответствии с возрастными нормами"];
const List<String> COMMUNICATION_SKILLS_ITEMS = ["трудности в общении со сверстниками", "трудности обусловлены уровнем коммуникативных умений", "низкая социальная активность, безинициативность","замкнутость, пассивность", "скованность", "неуверенность", "плаксивость", "враждебность", "агрессивное поведение", "не соблюдение правил поведения и правил игры", "не усвоены нравственные законы и правила поведения", "не умение строить отношения со сверстниками", "отсутствие волевого поведения", "легко вступает в контакт, дружит с одногруппниками", "проявляет лидерские качества, самостоятельно придумывает игры", "гипердинамический"];
const List<String> CHOOSEN_ACTIVITY_ITEMS = ["предпочитает играть с мальчиками","предпочитает играть с девочками", "играет с куклами", "играет с машинками", "играет в больницу", "играет в магазин", "в парикмахерскую","в салон красоты", "любит играть с конструктором", "любит рисовать, лепить, творческие занятия","с удовольствием посещаеь музыкальные занятия", "любит физкультуру и бассейн", "предпочитает подвижные игры", "предпочитает игры на свежем воздухе", "предпочитает спокойные занятия", "играет с машинками, конструктором"];
const List<String> GENERAL_AWARENESS_ITEMS = ["знает свою фамилию, имя, возраст", "называет членов семью по именам","недостаточно сформированы временные и пространственные представления, представления об окружающем", "пространственно и временные представления сформированы не в полном объеме", "соответствует возрастным нормам", "не соответсвует возрастным нормам"];
const List<String> ELEMENTS_OF_MATH_ITEMS = ["сформированы в соответсвии с программой","считает до 5 неуверенно", "счет до 5", "осуществляет счет в пределах 10 с ошибками","ведет счет в пределах 10","сформировано предствавление о цвете, форме, величине предмета","знает величину, цвет, форму", "знает и называет цвета, форму предмета","выделяет понятия \"больше\", \"меньше\"", "группирует предметы по признаку количества(много, один)", "понятия \"высокий-низкий\", \"узкий-широкий\", \"длинный-короткий\" усвоены","не сформированы понятия \"высокий-низкий\", \"узкий-широкий\", \"длинный-короткий\" , хорошо ориентируется в понятиях \"большой-маленький\"", "не сформированы"];
const List<String> LETTERS_KNOWLEDGE_ITEMS = ["не знает буквы","знает большинство букв, но иногда путает", "буквы знает, но в слоги объединяет неуверенно", "знает большинство букв, объединяет в слоги", "знает буквы, проявляет интерес к чтению"];
const List<String> ARTS_ITEMS = ["в соответствии с возрастом","проявляет интерес к различным видам конструкторов","аккуратен(на) в рисовании и лепке, при раскрашивании не выходит за контур","требуется контроль взрослого","уверенно держит ножницы, вырезает по контуру","ножницы держит неуверенно"];
const List<String> CONTACT_ITEMS =[
  "легко и быстро устанавливает контакт, проявляет в нем заинтересованность, охотно подчиняется",
  "в контакт вступает легко, но он носит нестабильный характер (из-за трудностей, низкой работоспособности)",
  "контакт устанавливается легко, но носит формальный, поверхностный характер (контакт чисто внешний, неполноценный)",
  "в контакт вступает не сразу, с небольшим трудом, но в последующем контакт стабильный, полноценный",
  "в контакт вступать отказывается, проявляет негативизм",
  "крайне редко, принудительно контактирует",
  "не устанавливает контакт с незнакомыми (взрослыми, детьми, сверстниками), со знакомыми по жизненной необходимости",
  "не устанавливает контакт с незнакомыми, со знакомыми поддерживает взаимодействие через тактильные напоминания",
  "с незнакомыми устанавливает контакт в присутствии знакомых (взрослых, детей, сверстников), стремится к привычному кругу общения",
  "устанавливает контакт с незнакомыми, к взаимодействию не стремится; со знакомыми способен поддерживать взаимодействие",
  "вступает в контакт с избранными незнакомыми, при взаимодействии проявляет низкую активность",
  "вступает в контакт, поддерживает взаимодействие",
  "легко вступает в контакт с избранными (взрослыми, детьми, сверстниками), поддерживает взаимодействие",
  "легко вступает в контакт, активен при взаимодействии",
  "легко вступает в контакт, стремится быть в центре внимания",
  "навязывает свое общение"
];
const List<String> EMOTIONS_ITEMS = [
  "адекватная реакция на ситуацию обследования",
  "реакция на ситуацию обследования неадекватная",
  "внешне эмоциональные проявления отчетливо выражены и разнообразны",
  "эмоциональная напряженность, утрированная серьезность в сочетании с выраженной нерешительностью",
  "чрезмерная выраженность сензитивных реакций",
  "чрезмерная выраженность негативных эмоциональных реакций",
  "эмоциональная индифферентность",
  "эмоциональная лабильность",
  "зависимость чувств от потребностей (УО)"
];
const List<String> EMOTIONALFON_ITEMS = [
  "уравновешенный",
  "тревожный",
  "депрессивный",
  "безразличный",
  "эйфоричный",
  "дисфоричный",
];
const List<String> REACTIONPOSSHRENIE_ITEMS = [
  "вызывает окрашенную положительными эмоциями реакцию",
  "наряду с проявлениями радости, отмечается резкое повышение результативности выполнения заданий",
  "дурашливость, неадекватность поведения",
  "равнодушное отношение"
];
const List<String> REACTIONPORICATIEN_ITEMS = [
  "После сделанного замечания, старается исправить ошибку",
  "Отказывается от дальнейших действий, раздражается, замыкается и т.п.",
  "Ярко выраженные негативные, агрессивные реакции на предъявленные требования",
  "Отсутствие реакций на замечания"
];
const List<String> SELFESTIMATE_ITEMS = [
  "завышенная",
  "адекватная",
  "нормальная"
  "заниженная"
];
const List<String> CARACTER_SPECIAL_ITEMS = ["живой(ая)", "неусидчивый(ая)", "усидчив(ая)", "последователен(а)", "веселый(ая)", "пассивный(ая)", "нетерпелив(ая)", "быстро теряет интерес", "тяготится выполнением задания", "проявляет выраженный интерес к заданиям", "старается уклониться от трудностей", "проявляет беспокойство, суетливость", "раздражается, обижается на замечания", "стремление доминировать", "оптимистичен(а), неуверн(а) в себе, сдержан(а) в общении", "избирателен(на) в общении", "недостаток инциативы", "безудержность побуждений, упрямство" ];
const List<String> COORDINATION_ACTIVITY_ITEMS = ["сохраняет принятую позу"," движения естественные","движения точные", "принятая поза не сохраняется", "повышены сила", " слабость", "нарушена точность движений", "гипертонус", "гипотонус", "шаркающая походка"];
const List<String> GENERAL_MOTORICA_ITEMS = ["сохранна", "без особенностей", "нарушена"];
const List<String> LITTLE_MOTORICA_ITEMS = [
  "манипулятивная функция развита достаточно", "движения быстрые и точные, координированные", "в норме", "развита достаточно", "манипулятивная функция несколько ограничена", "манипулятивная функция ограничена", "развита недостаточно",
  "нарушена", "наблюдается неловкость пальцевой моторики", "нарушена координации, точности движений", "трудности манипулирования предметами при наличия хватания", "недостаточность мелкой моторики(не справляется с пуговицами, молнией)", "тремор"];
const List<String> MIMICAL_MOTORICA_ITEMS = ["лицо аммичное(каменное)","бедность мимики", "мышцы лица малоподвижны, совершает движения глазами и ртом, но улыбается", "средняя подвижность мышц, может смеяться, хмуриться", "мимикой может показать некоторые свои состояния, выражать желание, неделание", "средняя подвижность мышц, может улыбаться, вращать глазами, поднимать брови, поджимать губы", "средняя подвижность мышц, по мимическому выражению можно догадаться о состоянии ребенка(радость, боль, страх)", "мимика адекватна ситуации, мимически выражает свое эмоциональное состояние", "мимика подвижна, может заменять мимикой слова", "артистическая мимика, может все выражать без слов"];
const List<String> PRIORITY_HAND_ITEMS = [
  "правая",
  "левая",
  "амбидекстр",
  "смешанное преобладание"
  "не сформирована"
];
const List<String> PROIZVOL_ITEMS =["способность к длительному сосредоточению и переключению внимания", "способность к концетрации внимания проявляется нестойка", "концетрация на короткий срок","произольное внимание не сформировано","рассеянное"];
const List<String> SUSTAINABILITY_ITEMS =["устойчивое, длительное сосредоточение и переключение удовлетворительные","отвлекаемость наблюдается к концу задания", "колебания внимания отмеяаются по мере столкновения с трудностями", "недостаточно устойчивое, поверхностное, быстро истощается", "вязкое, плохо переключаемое, организующая помощь эффективна", "плохо сосредотачивается, с трудом удерживает внимание на объекте", "низкая концетрация, неустойчивость на протяжении всего обследования", "выраженная регидность, вязкость, организующая помощь мало эффективна"];
const List<String> VOLUME_ITEMS = ["достаточный","незначительно сужен","ограниченный","узкий"];
const List<String> PERCEPTION_ITEMS = ["соотносит свойства предметов с заданым эталоном","целостное точное, достаточно дифференцированное", "объем незначительно ограничен","не усвоены все основные эталоны(цвет, форма, величина)", "трудности в узнавании, не соотносит предмет с эталоном", "восприятие далекого пространства мало дифференцированно", "замедленность темпа и сужен объем", "выраженная недифференцированность", "инактивность восприятия"];
const List<String> TACTICAL_PERCEPTION_ITEMS = ["без особенностей", "сохранно","дифференцированное", "дифференцирует по признаку(теплый и т.п.)", "недифференцированное", "наружено"];
const List<String> SPACE_PERSEPTION_ITEMS =  [
  "способен ориентироваться в пространстве",
  "показывает направления, но не называет ",
  "знает какое-либо одно пространственное направление",
  "может показать направления относительно себя и двигаться в этом направлении",
  "называет некоторые направления",
  "показывает направления: вправо-влево, вверх-вниз",
  "показывает направления: вправо-влево, вверх-вниз, за собой - перед собой",
  "обозначает (словами) пространственное положение объекта",
  "зрительно оценивает расстояние, понимает понятия: ближе, дальше и др.",
  "свободно ориентируется в пространстве, обозначает его",
  "ориентируется на листе бумаги", "не сформированы"
];
const List<String> TIME_PERSEPTION_ITEMS = ["ориентируется в понятиях вчера - сегодня - завтра",  "ориентируется в частях суток",  "знает дни недели",  "знает месяцы, времена года", "но может перепутать", "не сформированы"];
const List<String> CONSTRUCTIVE_PRACSIS_ITEMS = ["сделал постройку по замыслу", "строит по заданной инструкции с разъясняющей помощью", "строит по образцу", "строит по образцу с помощью взрослого", "нарушен", "плохо ориентируется в задаче, теряется", "не подражает, задание недоступно","2-х составленая картинка"];
const List<String> MEMORY_ITEMS = ["преобладает непроизвольное запоминание", "легко запоминает яркие красивые предметы, привлекающие внимание",
  "характер памяти избирательный", "замедленность, непрочность процесса запоминания", "непрочность сохранения информации", "воспроизводит непоследовательно, нуждается в наводящих вопросах", "концетрируется на второстепенных объектах, не улавлиает главное", "механическое запоминание без осмысления", "продуктивность запоминания повышается с опорой на зрительные образы", "снижена скорость запоминания, требуется многократное повторение", "хорошая", "в норме", "объем зрительной памяти соответсвует возрасту, легко и быстро запоминает наглядный материал", "объем слухоречевой памяти недостаточный"];
const List<String> IMAGINATION_ITEMS = ["рассказ составлен с домысливанием начала и конца", "рассказ содержит элементы вымысла", "рассказ составлен по шаблонной схеме, по наводящим вопросам", "рассказ отсутствует", "домысливание недоступно", "богатое", "развито на высоком уровне", "недостаточно развито"];
const List<String> ACCEPT_TASK_ITEMS = ["инструкция понимается, сохраняется до конца задания", "инструкция принимается, ребенок входит  работу постепенно, с трудом", "некоторые правила постигаются в процессе работы", "инструкция теряется", "самоконтроль в отношении части инструкции", "принимается общая цель задания, элементы инструкции", "ребенок не соблюдает до конца задание даже легкие правила", "стихийная активность, инструкция не усвоена", "вместо заданной задачи, решает быстро простоую"];
const List<String> MODES_OF_ACTION_ITEMS = ["метод зрительного соотнесения", "метод проб и ошибок", "хаотические пробы(метод силы)", "метод силы", "силовые пробы"];
const List<String> FORM_OF_THINK_ITEMS = ["конкретное мышление", "мыслительные операции требует развития", "зачатки наглядно-действенного мышления(нецеленаправленные действия с предметами)", "наглядно-действенное", "наглядно-действенное с элементами наглядно-образного", "наглядно-образное", "наглядно-образное с элементами словесно-логического", "словесно-логическое"];
const List<String> ANALYS_SYNTES_ITEMS = ["планомерно, точный","продуктивность выше при расчленении задания", "непланомерный", "неточный, односторонний", "хаотичен, бессистемный", "нет структуры, на первый план выходит броское, яркое", "компонениы не может соединить в целом"];
const List<String> GENERALIZATION_ITEMS = ["обобщает по существенным признакам", "ориентируется на второстепенные несущественные признаки","обобщения расплывчаты", "слабо дифференцированы", "слабость обобщений, плохо усваивает правила и общие понятия, склонность к конкретному мышлению", "обобщение узкое"];
const List<String> PERENOS_ITEMS = ["перенос полный в словесной форме(называет признаки)", "частичный, в словесной форме(выделяет и называет не менее 2-ч признаков", "полный, в действиях(совершает три правильные группировки)", "частичный, в действиях(не менее 2-ч в правильных группировок", "отсутствует"];
const List<String> SRAVNENIE_ITEMS = ["не выделяет существенные признаки, не понимает смысловую связь","понимает связь, но не может правильно объяснить","устанавливает логическую связь","отстутствует"];
const List<String> UPOR_ITEMS = ["по существенным признакам","затрудняется в объединении групп","по несуществующим признакам","не упорядочивает"];
const List<String> RESULT_WORK_ITEMS = ["ошибки при выполнения задания отсутствуют", "допускаются ошибки, но испраляются самостоятельно", "ошибки самостоятельно не замечаются, для правильного выполнения всего или части задания требуется помощь", "при оказании помощи ошибки не замечаются, не мсправляются", "не замечает ошибки, требуется повторение инструкции"];
const List<String> USE_KINDS_OF_HELP_ITEMS = ["стимулирующая (подбадривание, похваливания)", "организующая (организация внимания на каком-то моменте выполнения задания \"торопись\", \"посмотри внимательно\")", "разъясняющая(уточнение порядка действий при выполнении задания)", "наглядно-действенная(продемонстрировать способ действия без объяснения алгоритма его вполнения)", "обучающая(конкретная), разъяснение с показом", "стимулирующая", "организующая", "разъясняющая", "наглядно-действенная", "обучающая", "все виды помощи"];
const List<String> OCCUPATION_ACTIVITY_ITEMS = ["активно и целенаправлено действует в соответствии с поставленной целью", "активность и целенаправленность резко снижается из-за неудач, замеаний найсточивости внимания, пресыщения деятельностью", "недостаточно активная, целенаправленная, но улучшаемая стимуляцией", "очент инертная", "бесцельная, хаотичная, не улучшаема стимулицией", "очент инертная","бесцельная, хаотичная, не улучшаемая стимуляцией, разъяснениями", "беспорядочность действий", "отсутствие целенаправленности, \"скользящее внимание\"", "действие на соответствует характеру и цели задания", "действие беспорядочны, но направлены на решение задачи", "действия соответствуют цели задания при большой заинтересованности", "при заинтересованности действия доводятся до конца", "действия соответсвуют выполению задания для достижения цели", "получает удовольствие от работы и результатов труда", "скурпулезно выполняет задание", "не может переключиться на другой вид деятельности по достижению результатов", "\"зациклинность\", навязчивость"];
const List<String> MOTIVATION_ITEMS = ["проявляет интерес ко всему процессу обследования", "избирательный интерес (к....)", "принимает ситуацию как неизбежное","негативное отношение", "мотивация отсутствует","руководствуется ближайшими мотивами", "преобладает игровая над учебной"];
const List<String> TEMP_ITEMS = ["умеренный темп, равномерный на протяжении выполнения всего задания",
  "медлительность, но равномерность на протяжении выполнения всего задания",
  "умеренный, либо высокий темп сменяется медлительностью или наоборот",
  "неравномерная динамика",
  "импульсивность, расторможенность, поспешность в выполнении задании",
  "крайняя медлительность, заторможенность"];
const List<String> RABOTOSPOSOBNOST_ITEMS = ["работоспособность сохраняется до конца задания",
  "работоспособность умеренная (наблюдается истощение деятельности примерно с середины или к концу задания)",
  "мерцательный характер работоспособности",
  "работоспособность низкая (наблюдается истощение деятельности с начала выполнения задания)"];
const List<String> TEACHER_DEFECT_ITEMS = ["М.И. Тимохина", "И.В. Дорощук", "С.А. Стадник", "И.В. Ничипорук","Т.Ф. Хапаль"];
const List<String> DORECHEVO_ITEMS = ["гуление и лепет отсутствовали до полугода","первые слова появились поздно","элементарная фразовая речь появилась после 2,5 лет", "речевое развитие прерывалось","речевое развитие прерывалось в связи со стрессовой ситуацией", "ранее занимался с логопедом","раннее речевое развитие ребенка согласно срокам"];
const List<String> IMPRESSION_SPEECH_ITEMS = ["понимание речи затруднено","понимает безречевую инструкцию","понимает отдельные инструкции в знакомых словосочетаниях","нуждается в неоднократном повторении задания","на обращение взрослого реагирует с опозданием","вербальные задания выполняет с неточностями","при выполнении задания теряет часть инструкции","понимание речи не нарушено","выполняет задания по словесной инструкции","удерживает в памяти 2-3 ступенчатую инструкцию"];
const List<String> EKSPRESSION_SPEECH_ITEMS =["отсутствие словесных средств общения","не использует речь, общается при помощи жестов и мимики","использует невербальные средства общения","речевая активность низкая","фразовой речи нет","произносит отдельные звуки и звукокомплексы","использует несколько лепетных и общеупотребительных слов и звукоподражаний","пользуется простой аграмматичной фразой","пользуется простой нераспространенной фразой","пользуется простой малораспространенной фразой","фраза структурно нарушена","пользуется развернутой фразой"];
const List<String> DICTIONARY_ITEMS = ["словарь состоит из лепетных слов","словарь беден","словарь ограничен обиходно-бытовой тематикой","словарь ограничен бытовой лексикой","слова использует не всегда точно","использует слова не по назначению","смешение слов по смыслу и акустическому сходству","использует мало прилагательных, наречий","словарь беден лексикой, связанной с обозначением признаков и свойств предметов и действий","трудности при подборе синонимов, антонимов","страдает понимание и употребление обобщающих понятий","трудности в актуализации словаря","объём словаря достаточный","словарный запас соответствует возрасту"];
const List<String> SLOG_STRUCTURE_ITEMS =["нарушение звуко-слогового состава слова","искажает слоговую структуру слова","усечение слов, упрощение структуры слов","слоговая элизия","сокращает количество слогов в слове","сокращает слова до 1-2 слогов","не удерживает полную структуру многосложных слов","нарушает слоговую структуру малознакомых длинных слов","перестановка звуков и пропуск согласных при стечении","перестановка слогов","добавление количества слогов","персеверации, повторение слогов","правильное но замедленное послоговое воспроизведение многосложных слов","правильно воспроизводит 2-и 3-сложные слова","сохраняет слоговый рисунок слова","слоговая структура слова не нарушена"];
const List<String> GRAMMAR_STRUCTURE_ITEMS =["использует однословное предложение","использует предложения из слов-корней","грамматический строй недостаточно сформирован для данного возраста","допускает многочисленные ошибки при согласовании слов в предложении","несогласование слов во фразе, аграмматизмы","употребляет слова в начальной форме без согласования","неправильно употребляет предлоги, падежи","ошибки в употреблении существительных во множественном числе","ошибки употребления окончаний в связном высказывании","пропуск предлогов","неправильное употребление падежных форм","ошибки при согласовании существительных с числительным","допускает ошибки в употреблении временных форм глаголов","неуверенное использование требуемых падежных и глагольных форм","в основном правильно употребляет слова, согласуя их в падежах, изменяет по числам, временам и т.д.","иногда допускает малозначимые ошибки согласования слов, исправляет самостоятельно","использование флексий (окончаний) и предлогов для выражения связей слов","грамматический строй сформирован соответственно возрасту","практическое употребление падежных форм существительных и прилагательных, временных форм глаголов","речь грамотная"];
const List<String> GRAMMAR_SPEECH_ITEMS = ["развитие связной речи не соответствует возрасту","самостоятельно высказываться затрудняется","не отвечает на поставленные вопросы по тексту","описание картины вызывает большие трудности","составление рассказа по сюжетной картине вызывает большие трудности","рассказ по картине характеризуется бедностью и сжатостью","искажает смысл рассказа","рассказ характеризуется фрагментарностью и незавершенностью","хаотичность излагаемой информации при рассказе по картинке","неоднократное повторение уже сказанного","привлечение прошлого опыта при рассказе по картинке","однообразие и примитивность синтаксических структур при рассказе","при составлении рассказа и при ответах пользуется фразой несложной конструкции","выпадение смысловых звеньев при пересказе", "пропуск и искажение смысловых звеньев при пересказе","нарушение последовательности событий при пересказе","справляется, когда учитель задаёт наводящие вопросы","не использует образные средства языка","при составлении рассказа составляет логическую последовательность, но имеются ошибки в языковом оформлении высказывания","составляет рассказ и пересказ","не испытывает трудностей при составлении рассказа, пересказывании короткого текста","высокий уровень речевого развития","владеет связной речью"];
const List<String> SOUNDS_ITEMS = ["нарушение произношения шипящих и сонорных звуков","нарушение звонкости-глухости","нарушения мягкости-твёрдости","смягчение звуков","дефектное произношение звонких согласных (оглушение)","озвончение глухих согласных","смешение оппозиционных звуков","звукопроизношение с носовым оттенком","нарушено произношение сонорных звуков","нарушено произношение звуков [р], [р']","дефектное произношение звука [р]","горловое произношение звука [р]","велярное произношение звука [р]","изолированно все звуки произносит правильно, но при увеличении нагрузки наблюдается общая смазанность речи","речь чистая без нарушений звукопроизношения","нарушений звукопроизношения нет"];
const List<String> ARTIKUL_APPARAT_ITEMS = ["в строении артикуляционного аппарата отмечаются","в строении артикуляционного аппарата отмечается","толстые губы","тонкие губы","заячья губа","редкие зубы","кривые зубы","мелкие зубы","зубы вне челюстной дуги","крупные зубы без промежутков","большие промежутки между зубов","отсутствие нижних резцов","отсутствие верхних резцов""высокое, узкое небо","готическое нёбо","уплощенное нёбо","расщелина мягкого нёба","послеоперационный рубец мягкого нёба","подъязычная связка без особенностей","подъязычная связка незначительно укорочена","укороченная подъязычная уздечка","передний открытый прикус","боковой открытый прикус","глубокий прикус","прогнатия","прогения","перекрёстный прикус","приоткрытый рот","неумение удерживать закрытым рот","не удерживает позу закрытого рта","межзубное положение языка","массивный язык","маленький язык","географический язык","бледный язык","носогубные складки не выражены","анатомическое строение артикуляционного аппарата без аномалий","строение артикуляционного аппарата без особенностей"];
const List<String> ARTIKUL_MOTORICA_ITEMS = ["движения языка неточны", "движения языка не в полном объёме","снижена амплитуда движений языка","движения языка неточны при смене артикуляционных позиций","движения языка хаотичны","плохо ощущает положение языка","трудности удержания положения языка в статике","не удерживает артикуляционные позы","гиперкинезы языка","тремор языка","язык вялый, малоподвижный","движения языка замедленные","наблюдаются замены движений, синкинезии","синкинезии языка и нижней челюсти","синкинезии языка и головы","синкинезии языка и глазных яблок","переключаемость движений нарушена","девиация языка","гипертонус","гипотонус","мышечный тонус языка меняется","мышечное напряжение увеличивается при выполнении упражнений","язык напряжен и оттянут назад","повышенная саливация","гиперсаливация","точность выполнения движений сохранна","тонус языка нормальный, упражнения выполняет","артикуляционную позу удерживает достаточное время","артикуляционную позу удерживает","губы малоподвижные"];
const List<String> BREATHE_VIOCE_ITEMS = ["дыхание поверхностное","дыхание верхнее","дыхание неглубокое","дыхание рёберное","дыхание ключично-рёберное","дыхание неровное","дыхание свободное","голос громкий","голос звонкий, высокий","голос высокий (писклявый)","голос тихий","темп речи замедленный","монотонная речь","брадилалия","темп речи ускоренный","торопливая речь с перестановкой слов, слогов, проглатыванием части слов","тахилалия","темп и ритм речи в пределах нормы","речь интонационно недостаточно выразительная","речь выразительная","тембр голоса гнусавый"];
const List<String> ZAIKANIE_ITEMS = ["запинки в речи","тахилалия с запинками","повторение первых слогов в сложных словах","наличие дыхательных судорог","паузы перед началом речи","разрыв слов","наличие голосовых судорог","наличие вокальных голосовых судорог","протягивание гласных","наличие артикуляционных судорог", "Лицевые судороги. Проявляется при произнесении губных звуков п, б, м, в, ф","Язычные судороги. Проявляется при произнесении взрывных: т, д, г, к, х","Мягкого нёба. Нозализованный оттенок с повторением пм-пм, тн-тн, кн-кн","преобладают тонические судороги","преобладают клонические судороги","имеются сопутствующие движения"];
const List<String> FONEMATIC_HEAR_ITEMS = ["дифференцирует неречевые звуки","дифференцирует звуки по звонкости-глухости","дифференцирует звуки по мягкости-твёрдости","не дифференцирует звуки сходные по звучанию","слабо дифференцирует звуки сходные по звучанию","различает и повторяет слоги с оппозиционными фонемами (па-ба)","фонематический слух сформирован не в полном объеме","фонематический слух недостаточно сформирован","фонематический слух требует развития","фонематический слух сформирован"];
const List<String> FONEMATIC_ANALIS_SYNTES_ITEMS = ["место звука в слове не определяет","фонематический анализ и синтез не сформирован","фонематический анализ и синтез сформирован не в полном объеме","навыки звуко-буквенного анализа и синтеза недостаточно сформированы","определяет наличие звука в слове","определяет наличие звука в начале и в конце слова","определяет место звука в слове","выделяет первый звук в словах","выделяет первый и последний звук в слове","определяет количество звуков в слове","ошибки при определении количества звуков в слове","правильно образует слово называемое по звукам","определяет количество слогов в слове","затрудняется придумать слово на заданный звук","фонетический анализ и синтез в основном сформированы","трудности фонематического анализа"];
