const String HEADER =
    "ГУО \«Ясли-сад  № 555 г. Бреста\»\nПсихолого-педагогическая характеристика\n\nОбщие сведения";
const String FIOCHILD = " ФИО ребенка: ";
const String DATEOFBIRTH = " Дата рождения: ";
const String GROUPSTSPEC = " группа ст. спец. ";
const String HOMEADDRES = " Домашний адрес: ";
const String PHONENUMBER = " Конт. телефон ";
const String FAMILY = " Семья: ";
const String CONDITIONS = " Условия воспитания: ";
const String FIOMOTHER = " ФИО матери: ";
const String YEAROFBIRTH = " года рождения ";
const String EDUCATION = " образование: ";
const String HELP = " Какая помощь была оказана ранее: ";
const String RESULTSPSIX =
    "\Результаты психолого-педагогического обследования.\n\n Особенности развития личности и эмоционально-личностной сферы.";
const String CONTACT = " Контактность: ";
const String EMOTIONS = " Эмоции: ";
const String EMOTIONALFON = " Эмоциональный фон: ";
const String REACTIONFORPOOCHRENIEIPORICANIE =
    " Реакция на поощрение и порицание: ";
const String REACTIONPOSSHRENIE = " поощрение";
const String REACTIONPORICATIEN = " порицание";
const String SELFESTIMATE = " Самооценка и уровень притязаний: ";
const String CHARACTERSPECIFIC = " Характерологические особенности: ";
const String STATEOFMOTORSPHERE = " \Состояние двигательной сферы ";
const String COORDINATION =
    " Статистическая и динамическая координация, скорость, сила, точность движений: ";
const String GENERALMOTORICA = " Общая моторика: ";
const String LITTLEMOTORICA = " Мелкая моторика: ";
const String PRIORITYHAND = " Ведущая рука: ";
const String MIMICALMOTORICA = " Мимическая моторика: ";
const String DEVELOPOMENTDELAYS =
    " Особенности развития познавательной деятельности ";
const String ATTENTION = " Внимание: ";
const String PROIZVOL = "произвольность - ";
const String USTOICH = " устойчивость - ";
const String VOLUME = " объем - ";

const String RECOGNITION = " Восприятие: ";
const String TACTIL = " тактильное -  ";

const String SPACEPREDSTAVLENIE = " Пространственные представления:";
const String TIMEPREDSTAVLENIE = " Временные представления:";
const String CONSTRUCTIVEPRACSIS = " Конструктивный праксис:";
const String MEMORY = " Память: ";
const String IMAGINATION = " Воображение (последовательные картинки): ";
const String THINKING = " Мышление. Принятие  задачи: ";
const String MODESOFACTION = " Способы действия: ";
const String PREDOMINANTFORMOFTHINKING = " Преобладающая форма мышления: ";
const String OPERATIONSTORONA = " Операционная сторона: ";
const String ANALISANDSINTES = " анализ и синтез - ";
const String GENERALIZATION = " обобщение - ";
const String PERENOS = " перенос - ";
const String SRAVNENIE = " сравнение -  ";
const String UPORIADOCHIVANIE = " упорядочивание -  ";
const String RESULTATIVNOST = " Результативность выполнения задания и возможность коррекции ошибок: ";
const String DOZIROVANAYAHELP = " Использование различных видов дозированной помощи: ";
const String CHARACTERDEYATELNOSTI = " Характер деятельности: ";
const String MOTIVATION = " мотивация - ";
const String TEMPACTIVITYRABOTOSPOSOBNOST = " Темп деятельности и работоспособность: ";
const String TEMP = "  темп - ";
const String RABOTOSPOSOBNOST = "  работоспособность - ";
const String OSOBENNOTIRECHEVOGO = "  \Особенности речевого развития ";
const String IMPRESSIONSPEECH = "  Импрессивная речь: ";
const String EKSPRESSIONSPEECH = "  Экспрессивная речь: ";
const String DICTIONARY = "  Словарь: ";
const String SLOGSTRUCTURE = "  Слоговая структура слова:  ";
const String GRAMMATICALSTROY = " Грамматический строй:  ";
const String SVYASNAYASPEECH = " Связная речь: ";
const String SOUNDPROIZNOSHENIE = " Звукопроизношение: ";
const String ARTICULATION = " Артикуляционный аппарат: ";
const String ARTICULATIONMOTORICA = " Артикуляционная моторика: ";
const String GOLOSOOBRAZOVANIE = " Голосообразование и дыхание: ";
const String FONEMATICSOUND = " Фонематический слух: ";
const String OSOBENNOSTIRAZVITIEGAMING = " \Особенности развития игровой деятельности ";
const String CHARACTERACTIONWITHTIYS = " Характер действий с предметами-игрушками: ";
const String PROYAVLENIEINTERESA = " Проявление интереса к игрушкам, стойкость интереса: ";
const String ADEKVATNOSTTOYS = " Адекватность употребления игрушек: ";
const String USINGPRESMETOV = " Использование предметов-заместителей: ";
const String ADAPTIVEACTION = " \Адаптивное поведение ";
const String SELFCATERING = " Самообслуживание: ";
const String COMMUNICATIONALSKILLS = " Навыки общения: ";
const String PREDPOCHITAEMIEACTIVITY = " Предпочитаемые занятия: ";
const String LEVELOFSPECIAL = " \Уровень специальной подготовленности ";
const String GENERALAWARNESS = " Общая осведомленность: ";
const String ELEMENTSOFMATH = " Элементы математических представлений: ";
const String ZNANIEBUKV = " Знание букв, чтение: ";
const String IZOBRAZITELNAYAACTIVITY = " Изобразительная деятельность, навыки рисования, аппликации, лепки и конструирования: ";
const String ZAVEDYUSHI = " Заведующий ДУ  ";
const String VOSPITATEL = " Воспитатель ";
const String PEDAGOGPSIX = " Педагог-психолог ";
const String TEZHERDEFECT = " Учитель-дефектолог ";


















const List<String> GROUPOTSPEC = ["А", "Б", "В", "Г"];
const List<String> FAMILYITEM = [""]; //*

const List<String> CONTACTITEM = [
  "легко и быстро устанавливает контакт, проявляет в нем заинтересованность, охотно подчиняется",
  "в контакт вступает легко, но он носит нестабильный характер (из-за трудностей, низкой работоспособности)",
  "контакт устанавливается легко, но носит формальный, поверхностный характер (контакт чисто внешний, неполноценный)",
  "в контакт вступает не сразу, с небольшим трудом, но в последующем контакт стабильный, полноценный",
  "в контакт вступать отказывается, проявляет негативизм",
  "крайне редко, принудительно контактирует",
  "не устанавливает контакт с незнакомыми (взрослыми, детьми, сверстниками), со знакомыми по жизненной необходимости",
  "не устанавливает контакт с незнакомыми, со знакомыми поддерживает взаимодействие через тактильные напоминания",
  "с незнакомыми устанавливает контакт в присутствии знакомых (взрослых, детей, сверстников), стремится к привычному кругу общения",
  "устанавливает контакт с незнакомыми, к взаимодействию не стремится; со знакомыми способен поддерживать взаимодействие",
  "вступает в контакт с избранными незнакомыми, при взаимодействии проявляет низкую активность",
  "вступает в контакт, поддерживает взаимодействие",
  "легко вступает в контакт с избранными (взрослыми, детьми, сверстниками), поддерживает взаимодействие",
  "легко вступает в контакт, активен при взаимодействии",
  "легко вступает в контакт, стремится быть в центре внимания",
  "навязывает свое общение"
];
const List<String> EMOTIONSiTEM = [
  "адекватная реакция на ситуацию обследования",
  "реакция на ситуацию обследования неадекватная",
  "внешне эмоциональные проявления отчетливо выражены и разнообразны",
  "эмоциональная напряженность, утрированная серьезность в сочетании с выраженной нерешительностью",
  "чрезмерная выраженность сензитивных реакций",
  "чрезмерная выраженность негативных эмоциональных реакций",
  "эмоциональная индифферентность",
  "эмоциональная лабильность",
  "зависимость чувств от потребностей (УО)"
];
const List<String> EMOTIONALFONITEMS = [
  "уравновешенный",
  "тревожный",
  "депрессивный",
  "безразличный",
  "эйфоричный",
  "дисфоричный",
];

const List<String> REACTIONPOSSHRENIEITEM = [
  "вызывает окрашенную положительными эмоциями реакцию",
  "наряду с проявлениями радости, отмечается резкое повышение результативности выполнения заданий",
  "дурашливость, неадекватность поведения",
  "равнодушное отношение"
];

const List<String> REACTIONPORICATIENITEM = [
  "После сделанного замечания, старается исправить ошибку",
  "Отказывается от дальнейших действий, раздражается, замыкается и т.п.",
  "Ярко выраженные негативные, агрессивные реакции на предъявленные требования",
  "Отсутствие реакций на замечания"
];

const List<String> SELFESTIMATEITEM = [
  "завышенная",
  "адекватная (верная)",
  "заниженная"
];

const List<String> CHARACTERSPECIFICITEM = [
  " живой, усидчив, последователен",
  "веселый, пассивный, нетерпелив, быстро теряет интерес",
  "тяготится выполнением задания",
  "проявляет выраженный интерес к заданиям",
  "старается уклониться от трудностей",
  "переменчив в отношениях и интересах",
  "на внешние раздражители отвечает беспокойством, возбуждением, суетливостью",
  "раздражается, обижается на замечания",
  "стремление доминировать",
  "оптимистичен, самоуверен",
  "подавлен, неуверен в себе, сдержан в общении",
  "избирателен в общении",
  "недостаток инициативы",
  "безудержность побуждений, внушаемость и упрямство"
];

const List<String> COORDINATIONITEM = [
  "сохраняет принятую позу, движения естественные",
  "не сохраняется принятая поза, равновесие нарушается, движения неуклюжие, неловкие",
  "сила повышенная, точность нарушена (при гипертонусе)",
  "слабость, движения точные"
];

const List<String> GENERALMOTORICAITEM = ["без особенностей", "нарушена"];
const List<String> LITTLEMOTORICAITEM = [
  "манипулятивная функция развита достаточно: движения быстрые, точные, координированные",
  "нарушена",
  "манипулятивная функция несколько ограничена: наблюдается неловкость пальцевой моторики, нарушение координации, точности движений, тремор",
  "манипулятивная функция резко ограничена (трудности манипулирования предметами при наличии хватания)",
];
const List<String> MIMICALMOTORICAITEM = [
  " «каменное» лицо",
  "эмоциональная бедность",
  "мышцы лица малоподвижны, совершает движения глазами и ртом, не улыбается",
  "средняя подвижность мышц, может смеяться, хмуриться",
  "средняя подвижность мышц, может улыбаться, вращать глазами, поднимать брови, поджимать губы; мимика бедная",
  "средняя подвижность мышц, по мимическому выражению можно догадаться о состоянии ребенка (радость, боль, страх)",
  "мимикой может показать некоторые свои состояния, выражать желание, нежелание",
  "мимика адекватна ситуации, мимически выражает свое эмоциональное состояние (радость, печаль, грусть, удивление и т.п.)",
  "мимика подвижна, частичная замена слов мимикой",
  "артистическая мимика, может все выражать без слов мимикой"
];

const List<String> PRIORITYHANDITEM = [
  "правая",
  "левая",
  "амбидекстр",
  "смешанное преобладание"
];


const List<String> RANDOMNESSITEMSATTENTION = [
  "способность к длительному сосредоточению и переключению внимания",
  "способность к концентрации внимания проявляется нестойко",
  "концентрация на короткий срок",
  "произвольное внимание не сформировано"
];

const List<String> STABILITYITEMSATTENTION = [
  "устойчивое, длительное сосредоточение и переключение удовлетворительные",
  "отвлекаемость наблюдается к концу задания",
  "колебания внимания отмечаются по мере столкновения с трудностями",
  "недостаточно устойчивое, поверхностное; быстро истощается",
  "вязкое, плохо переключаемое, организующая помощь эффективна",
  "плохо сосредотачивается, с трудом удерживает внимание на объекте (низкая концентрация, неустойчиость) на протяжении всего обследования"
];

const List<String> VOLUMEITEMSATTENTION = [
  "достаточный",
  "незначительно ограничен (сужен)",
  "ограниченный (узкий)"
];

const List<String> RECOGNITIONITEM = [
  "целостное, точное, достаточно дифференцированное, соотносит свойства предметов с заданным эталоном",
  "незначительно ограничен объем, не усвоены все основные эталоны (цвет, форма, величина)",
  "значительно ограничено (сужено), трудности в узнавании, не соотносит предмет с эталоном",
  "восприятие далекого пространства мало дифференцированно (3-4 года)",
  "замедленность темпа и сужен объем",
  "выраженная недифференцированность",
  "инактивность восприятия"
];

const List<String> RECOGNITIONTACTICALITEM = [
  "дифференцированное (без особенностей)",
  "дифференцирует по признаку (теплый и т.п.)",
  "недифференцированное(нарушена)"
];

const List<String> SPACEPREDSTAVLENIEITEM = [
  "сенсорная система выключена",
  "способен ориентироваться в пространстве",
  "показывает направления, но не называет (для говорящих)",
  "знает какое-либо одно пространственное направление",
  "может показать направления относительно себя и двигаться в этом направлении",
  "называет некоторые направления",
  "показывает направления: вправо-влево, вверх-вниз",
  "показывает направления: вправо-влево, вверх-вниз, за собой - перед собой",
  "обозначает (словами) пространственное положение объекта",
  "зрительно оценивает расстояние, понимает понятия: ближе, дальше и др.",
  "свободно ориентируется в пространстве, обозначает его"
];

const List<String> TIMEPREDSTAVLENIEITEM = [
  "Вчера - сегодня - завтра",
  "части суток",
  "дни недели",
  "месяцы"
];

const List<String> CONSTRUCTIVEPRACSISITEM = ["сделал постройку по замыслу (психолог дает задание, например: «Построй гараж»)",
"строит по заданной инструкции с разъясняющей помощью",
"строит по образцу",
"не подражает, задание недоступно",
"плохо ориентируется в задаче, теряется"];

const List<String> MEMORYITEM = ["преобладает непроизвольное запоминание (до 3-4 лет). Легко запоминает яркие красивые предметы, привлекающие внимание",
"избирательный характер памяти",
"замедленность, непрочность процесса запоминания",
"непрочность сохранения, неточность восприятия",
"медленный темп восприятия",
"эйдетическая память (все как в книге, от своими словами)",
"при воспроизведении рассказа повторяет отдельные фразы, но не может изложить основной смысл",
"воспроизводит непоследовательно, нуждается в наводящих вопросах",
"концентрируется на второстепенных объектах, не улавливает главную мысль",
"пересказывает близко к тексту, старается передать основной смысл",
"пересказывает механически, не понимая основного смысла",
"рассказ с привнесением"];

const List<String> IMAGINATIONITEM = ["рассказ составлен с домысливанием начала и конца",
"рассказ содержит элементы вымысла",
"рассказ строго соответствует изображенному на картинке сюжету",
"рассказ составлен по шаблонной схеме, по наводящим вопросам",
"рассказ отсутствует",
"домысливание не доступно"];

const List<String> THINKINGITEM = ["инструкция понимается, сохраняется до конца задания",
"инструкция принимается, ребенок труднее входит в работу, некоторые правила постигаются в процессе работы",
"инструкция теряется, самоконтроль в отношении части инструкции",
"принимается общая цель задания, элементы инструкции; ребенок не сочиняет до конца задания даже легкие правила",
"стихийная активность, инструкция не усвоена",
"вместо заданной задачи, решает более простую"];

const List<String> MODESOFACTIONITEM = ["действие осуществляется с 1-2 ошибками и выполняется на основе выявленной закономерности, точная коррекция действия (метод зрительного соотнесения)",
"лабильность исполнительного действия, частичная ориентировка на существенные свойства объектов ситуации, увеличение пробующих, хаотических действий, коррекция действий в зависимости от результата (метод проб и ошибок)",
"при выполнении действия ориентирован на несущественные признаки, однотипность действий, многократное повторение однотипного действия, отсутствие коррекции в зависимости от результата",
"хаотические пробы (метод силы)"];

const List<String> PREDOMINANTFORMOFTHINKINGITEM = ["конкретное мышление (при У О)",
"мыслительные операции слабо развиты, купированы",
"зачатки наглядно-действенного мышления (нецеленаправленные действия с предметами)",
"наглядно-действенное (от 3-х до 5 лет) (целенаправленное действие с предметами)",
"наглядно-образное (5-7 лет) на уровне манипуляции с предметами, их взаимозамещение (предметы заместители)",
"словесно-логическое (после 7 лет)"];

const List<String> ANALISANDSINTESITEM = ["планомерный, точный",
"продуктивность выше при расчленении задания",
"непланомерный, неточный, односторонний",
"хаотичен, бессистемный, нет структуры, на первый план выходит броское, яркое",
"компоненты не может соединить в целом"];

const List<String> GENERALIZATIONITEM = ["обобщает по существенным признакам",
"ориентируется на второстепенные несущественные признаки",
"обобщения расплывчаты, слабо дифференцированы",
"слабость обобщений, плохо усваивает правила и общие понятия, склонность к конкретному мышлению",
"обобщение узкое"];

const List<String> PERENOSITEM = ["перенос полный в словесной форме (называет признаки)",
"частичный, в словесной форме (выделяет и называет не менее 2-х признаков)",
"полный, в действиях (совершает три правильные группировки)",
"частичный, в действиях (не менее 2-х правильных группировок)",
"отсутствует"];

const List<String> SRAVNENIEITEM = ["не выделяет существенные признаки, не понимает смысловую связь",
"понимает связь, но не может правильно объяснить",
"устанавливает логическую связь"];

const List<String> UPORIADOCHIVANIEITEM = ["по существенным признакам; затрудняется в объединении групп",
"по несущественным признакам",
"не упорядочивает"];

const List<String> RESULTATIVNOSTITEM = ["ошибки по ходу выполнения задания отсутствуют",
"допускаются ошибки, но исправляются самостоятельно",
"ошибки самостоятельно не замечаются, для правильного выполнения всего или части задания требуется помощь",
"при оказании помощи ошибки не замечаются, не исправляются"];

const List<String> DOZIROVANAYAHELPITEM = ["стимулирующая (в виде подбадривания, похваливания)",
"организующая (организация внимания на каком-то моменте выполнения задания: «торопись», «посмотри внимательно»)",
"разъясняющая (уточнение порядка действий при выполнении задания)",
"наглядно-действенная (продемонстрировать способ действия оез ооъясненш алгоритма его выполнения)",
"обучающая (конкретная), разъяснение с показом"];

const List<String> CHARACTERDEYATELNOSTIITEM = ["активно и целенаправленно действует в соответствии с поставленной целью",
"активность и целенаправленность резко снижается из-за неудач, замечаний неустойчивости внимания, пресыщения деятельностью",
"недостаточно активная, целенаправленная, но улучшаемая стимуляцией",
"очень инертная, либо бесцельная, хаотичная, не улучшаемая стимуляцией J разъяснениями",
"беспорядочность действий",
"отсутствие целенаправленности, «скользящее внимание»",
"действие не соответствует характеру и цели задания",
"действия беспорядочны, но направлены на решение задачи",
"действия соответствуют цели задания при большой заинтересованности",
"при заинтересованности действия доводятся до конца",
"действия соответствуют выполнению задания для достижения цели",
"получает удовольствие от работы и результатов труда",
"скрупулезно выполняет задание",
"не может переключиться на другой вид деятельности по достижению результатов",
"«зацикленность», навязчивость"];


const List<String> MOTIVATIONITEM = ["проявляет интерес ко всему процессу обследования",
"избирательный интерес (к чему?)",
"принимает ситуацию как неизбежное",
"негативное отношение",
"мотивация отсутствует",
"руководствуется ближайшими мотивами"];

const List<String> TEMPITEM = ["умеренный темп, равномерный на протяжении выполнения всего задания",
"медлительность, но равномерность на протяжении выполнения всего задания",
"умеренный, либо высокий темп сменяется медлительностью или наоборот",
"неравномерная динамика",
"импульсивность, расторможенность, поспешность в выполнении задании",
"крайняя медлительность, заторможенность"];

const List<String> RABOTOSPOSOBNOSTITEM = ["работоспособность сохраняется до конца задания",
"работоспособность умеренная (наблюдается истощение деятельности примерно с середины или к концу задания)",
"мерцательный характер работоспособности",
"работоспособность низкая (наблюдается истощение деятельности с начала выполнения задания)"];





